In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

Assign all the CSV files to something and add comments to it

In [3]:
#Titles, Studio, Domestic Gross, Foreign Gross and Year
#3387 rows
movies_gross = pd.read_csv("zippedData/bom.movie_gross.csv")
#Nconst, Primary Name, Primary Profession, Known for titles(title_id)
#606648 rows
basics_names = pd.read_csv("zippedData/name.basics.csv")
#Title ID's, Ordering, Title, Region, Language, Types, Attributes, Original Title
#331703 rows
akas = pd.read_csv("zippedData/title.akas.csv")
#Tconst, Primary Title, Original Title, Start Year, Runtime Minutes, Genres
#146144 rows
basics_titles = pd.read_csv("zippedData/title.basics.csv")
#Tconst, Directors, Writers
#146144 rows
crew = pd.read_csv("zippedData/title.crew.csv")
#Tconst, Ordering, Nconst, Category, Job, Characters
#1028186 rows
principals = pd.read_csv("zippedData/title.principals.csv")
#Tconst, Average Rating, Number of Votes
#73856 rows
ratings = pd.read_csv("zippedData/title.ratings.csv")
#Genre Id, Id, Original Language, Original Language, Original Title, Popularity, Release Date, Title, Vote Average, Vote count 
#26517 rows
movies = pd.read_csv("zippedData/tmdb.movies.csv")
#Id, Release Date, Movie Name, Production Budget, Domestic Gross, Worldwide Gross
#5782 rows
movies_budgets = pd.read_csv("zippedData/tn.movie_budgets.csv")

Assign all the TSV files to something and add comments to it

In [4]:
#Id, Synopsis, Rating, Genre, Director, Writer, Theater Date, Dvd Date, Currency, Box Office, Runtime, Studio
#1560 rows 
movie_info = pd.read_csv("zippedData/rt.movie_info.tsv", sep='\t')
#Id, Reviews, Rating, Fresh, Critic, Top Critic, Publisher, Date
#54432 rows
reviews = pd.read_csv("zippedData/rt.reviews.tsv", sep='\t', encoding = 'unicode_escape')

2009 from 2019, treat 2020 as a special year

In [5]:
# Creating a table with only the rating, how much it made and it's genre
# Cleaning NAN values
rating_genre_box = movie_info.drop(['id','currency','director', 'synopsis', 'writer', 'theater_date', 'dvd_date', 'runtime', 'studio'], axis=1)
rating_genre_box.dropna(inplace=True)

In [6]:
rating_genre_box

     rating                                             genre  box_office
1         R                 Drama|Science Fiction and Fantasy     600,000
6     PG-13                                            Comedy  41,032,915
7         R                                             Drama     224,114
8         R                                             Drama     134,904
15        R                 Comedy|Drama|Mystery and Suspense   1,039,869
...     ...                                               ...         ...
1541  PG-13  Action and Adventure|Science Fiction and Fantasy  25,335,935
1542     NR                                      Comedy|Drama   1,416,189
1545      R                       Horror|Mystery and Suspense      59,371
1546     PG          Art House and International|Comedy|Drama     794,306
1555      R  Action and Adventure|Horror|Mystery and Suspense  33,886,034

[340 rows x 3 columns]

In [7]:
# Creating a table that contains Titles, Genres and Tconst
# Cleaning NAN values
# Using split to create a new column with separeted Genres
# Droping the unused Genres columns
title_genre = basics_titles.drop(['original_title', 'start_year', 'runtime_minutes'], axis=1)
title_genre.dropna(inplace=True)
title_genre['genre_new'] = title_genre['genres'].str.split(",")
title_genre.drop('genres', axis=1, inplace=True)

In [8]:
title_genre

,tconst,primary_title,genre_new
0,tt0063540,Sunghursh,"[Action, Crime, Drama]"
1,tt0066787,One Day Before the Rainy Season,"[Biography, Drama]"
2,tt0069049,The Other Side of the Wind,[Drama]
3,tt0069204,Sabse Bada Sukh,"[Comedy, Drama]"
4,tt0100275,The Wandering Soap Opera,"[Comedy, Drama, Fantasy]"
...,...,...,...
146138,tt9916428,The Secret of China,"[Adventure, History, War]"
146139,tt9916538,Kuambil Lagi Hatiku,[Drama]
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,[Documentary]
146141,tt9916706,Dankyavar Danka,[Comedy]
146143,tt9916754,Chico Albuquerque - Revelações,[Documentary]

Trying to integrate "title_genre" with "ratings" to measure sucess based on ratings

Still trying to figure out a way to make the genre works 
    - How to divide into 1 when have multiples? 
    - How to join the tables?

In [9]:
#Creating a table with Movies name, Budget, Domestic Gross, worldwide_gross
# Cleaning NAN values
movies_money = movies_budgets.drop(['release_date', 'id'], axis=1)
movies_money.dropna(inplace=True)

In [10]:
movies_money

,movie,production_budget,domestic_gross,worldwide_gross
0,Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...
5777,Red 11,"$7,000",$0,$0
5778,Following,"$6,000","$48,482","$240,495"
5779,Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,A Plague So Pleasant,"$1,400",$0,$0
5781,My Date With Drew,"$1,100","$181,041","$181,041"

In [19]:
basics_titles.sort_values(by='start_year', ascending=False)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
89506,tt5174640,100 Years,100 Years,2115,NaN,Drama
96592,tt5637536,Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"
2949,tt10300398,Untitled Star Wars Film,Untitled Star Wars Film,2026,NaN,Fantasy
52213,tt3095356,Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
105187,tt6149054,Fantastic Beasts and Where to Find Them 5,Fantastic Beasts and Where to Find Them 5,2024,NaN,"Adventure,Family,Fantasy"
...,...,...,...,...,...,...
74712,tt4264626,Civil War Life: Shot to Pieces,Civil War Life: Shot to Pieces,2010,79.0,Documentary
14471,tt1716746,Heinrich Kieber - Datendieb,Heinrich Kieber - Datendieb,2010,52.0,Documentary
74692,tt4263706,Mushrooms of America,Mushrooms of America,2010,46.0,"Adventure,Comedy,Documentary"
118065,tt7059624,Zamana,Zamana,2010,140.0,Drama
94000,tt5475580,A Boy and A Girl,A Boy and A Girl,2010,NaN,Romance

In [20]:
if basics_titles.start_year

2013